In [1]:
%matplotlib inline
import pandas as pd, numpy as np, matplotlib.pyplot as plt

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [2]:
df = pd.read_csv('data/summer-travel-gps-full.csv')
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [3]:
summer_travel_gps_full = df

In [4]:
summer_travel_gps_full.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

## q1

In [12]:
city_country_columns = summer_travel_gps_full.loc[:, ['city', 'country']]

In [13]:
city_country_columns.head()

           city         country
0  West Drayton  United Kingdom
1      Hounslow  United Kingdom
2      Hounslow  United Kingdom
3      Hounslow  United Kingdom
4      Hounslow  United Kingdom

## q2

In [22]:
city_country_columns.loc[0:4, 'city']

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
4        Hounslow
Name: city, dtype: object

In [25]:
summer_travel_gps_full['city'].head()

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
4        Hounslow
Name: city, dtype: object

In [26]:
summer_travel_gps_full.city[0:4]

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
Name: city, dtype: object

In [27]:
summer_travel_gps_full['city'][0:4]

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
Name: city, dtype: object

## q3

In [21]:
summer_travel_gps_full.loc[3, :]

lat               51.478199
lon               -0.446081
date       05/14/2014 11:24
city               Hounslow
country      United Kingdom
Name: 3, dtype: object

### q4

In [23]:
summer_travel_gps_full.loc[1, "country"]

'United Kingdom'

### Q5: how to select the first 4 rows of ['city', 'date'] columns?

In [29]:
summer_travel_gps_full.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [33]:
summer_travel_gps_full.loc[0:4, ["city","date"]]

pandas.core.frame.DataFrame

In [34]:
summer_travel_gps_full.loc[0:4, ["city","date"]]

           city              date
0  West Drayton  05/14/2014 09:07
1      Hounslow  05/14/2014 09:22
2      Hounslow  05/14/2014 10:51
3      Hounslow  05/14/2014 11:24
4      Hounslow  05/14/2014 11:38

In [ ]:
city = pd.DataFrame({'city_stats' : [632, 1638, 569, 115],
                         'other_feature' : [438, 833, 234, 298]},
                         index=['Glasgow', 'Edinburgh', 'London', 'Bristol'])


#key is city_stats and other_feature ; 1 dictionary {}, column name is index which is 0,1,2,3 if it is not there


### use .iloc for integer position based indexing
### Q6: how to get the value from the row in position 3 and the column in position 2

In [35]:
summer_travel_gps_full.iloc[3,2]

'05/14/2014 11:24'

### Q7: how to use iloc to select every 300th row from a data set

In [44]:
every_300th_panda = pd.DataFrame()

every_300th_list = []
for i in range(0,len(summer_travel_gps_full), 300):
    every_300th_list.append(summer_travel_gps_full.loc[i, ["city","date"]])
    print(summer_travel_gps_full.loc[i, ["city","date"]])

city        West Drayton
date    05/14/2014 09:07
Name: 0, dtype: object
city           Barcelona
date    05/20/2014 03:18
Name: 300, dtype: object
city              Krakow
date    05/31/2014 21:10
Name: 600, dtype: object
city            Tübingen
date    06/09/2014 15:12
Name: 900, dtype: object
city           Barcelona
date    06/17/2014 16:37
Name: 1200, dtype: object
city             Prizren
date    06/30/2014 08:27
Name: 1500, dtype: object

In [45]:
every_300th_list

[city        West Drayton
 date    05/14/2014 09:07
 Name: 0, dtype: object,
 city           Barcelona
 date    05/20/2014 03:18
 Name: 300, dtype: object,
 city              Krakow
 date    05/31/2014 21:10
 Name: 600, dtype: object,
 city            Tübingen
 date    06/09/2014 15:12
 Name: 900, dtype: object,
 city           Barcelona
 date    06/17/2014 16:37
 Name: 1200, dtype: object,
 city             Prizren
 date    06/30/2014 08:27
 Name: 1500, dtype: object]

In [46]:
# load a reduced set of gps data
simplified = pd.read_csv('data/summer-travel-gps-simplified.csv')
simplified.tail()

           lat        lon              date      city  country
173  41.044556  28.983286  07/08/2014 16:44  Istanbul   Turkey
174  41.008992  28.968268  07/08/2014 20:03  Istanbul   Turkey
175  41.043487  28.985488  07/08/2014 22:18  Istanbul   Turkey
176  40.977637  28.823879  07/09/2014 09:03  Istanbul   Turkey
177  48.357110  11.791346  07/09/2014 13:20    Munich  Germany

### Q9: create a Series of true/false, indicating if each "city" row in the column is equal to "Munich"

In [48]:
simplified['city'].value_counts()

Barcelona                 28
Istanbul                  12
Prague                    10
Lisbon                     9
Dytiki Ellada              6
                          ..
Tarnowskie Góry County     1
Gliwice                    1
Ruda Slaska                1
Imielin                    1
Munich                     1
Name: city, Length: 91, dtype: int64

In [50]:
simplified['city'].isin(['Munich'])

0      False
1      False
2      False
3      False
4      False
       ...
173    False
174    False
175    False
176    False
177     True
Name: city, Length: 178, dtype: bool

#### pandas logical operators are: | for or, & for and, ~ for not
#### these must be grouped by using parentheses
#### Q10: what cities were visited in spain that were not barcelona? Create a dataframe for it.

In [57]:
simplified.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  38.781775 -9.137544  05/14/2014 15:11        Lisbon        Portugal
2  38.711050 -9.139739  05/14/2014 16:40        Lisbon        Portugal
3  38.715637 -9.120558  05/14/2014 18:25        Lisbon        Portugal
4  38.711977 -9.141788  05/14/2014 19:26        Lisbon        Portugal

In [58]:
spain_not_barcelona = simplified[(simplified['country'] == 'Spain') &
                     (simplified['city'] != 'Barcelona')]

In [60]:
len(spain_not_barcelona)

6

In [61]:
spain_not_barcelona

           lat       lon              date                     city country
24   41.303911  2.105931  05/18/2014 22:35     El Prat de Llobregat   Spain
25   41.289946  2.064590  05/18/2014 23:04               Viladecans   Spain
126  41.306752  2.097624  06/12/2014 17:19     El Prat de Llobregat   Spain
127  41.304333  2.072728  06/12/2014 17:49     El Prat de Llobregat   Spain
131  41.358460  2.128701  06/13/2014 11:35  Hospitalet de Llobregat   Spain
138  41.294761  2.059722  06/20/2014 22:15               Viladecans   Spain

In [62]:
summer_travel_gps_full.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [64]:
spain_full = pd.DataFrame

In [65]:
spain_full.merge(summer_travel_gps_full, simplified, left_on='country', right_on='country')

,lat_x,lon_x,date_x,city_x,country,lat_y,lon_y,date_y,city_y
0,51.481292,-0.451011,05/14/2014 09:07,West Drayton,United Kingdom,51.481292,-0.451011,05/14/2014 09:07,West Drayton
1,51.474005,-0.450999,05/14/2014 09:22,Hounslow,United Kingdom,51.481292,-0.451011,05/14/2014 09:07,West Drayton
2,51.478199,-0.446081,05/14/2014 10:51,Hounslow,United Kingdom,51.481292,-0.451011,05/14/2014 09:07,West Drayton
3,51.478199,-0.446081,05/14/2014 11:24,Hounslow,United Kingdom,51.481292,-0.451011,05/14/2014 09:07,West Drayton
4,51.474146,-0.451562,05/14/2014 11:38,Hounslow,United Kingdom,51.481292,-0.451011,05/14/2014 09:07,West Drayton
...,...,...,...,...,...,...,...,...,...
43532,40.977637,28.823926,07/09/2014 09:18,Istanbul,Turkey,41.015594,28.962900,07/08/2014 11:45,Istanbul
43533,40.977637,28.823926,07/09/2014 09:18,Istanbul,Turkey,41.044556,28.983286,07/08/2014 16:44,Istanbul
43534,40.977637,28.823926,07/09/2014 09:18,Istanbul,Turkey,41.008992,28.968268,07/08/2014 20:03,Istanbul
43535,40.977637,28.823926,07/09/2014 09:18,Istanbul,Turkey,41.043487,28.985488,07/08/2014 22:18,Istanbul
43536,40.977637,28.823926,07/09/2014 09:18,Istanbul,Turkey,40.977637,28.823879,07/09/2014 09:03,Istanbul

### Q11: select rows where either the city is munich, or the country is serbia

In [69]:
simplified.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  38.781775 -9.137544  05/14/2014 15:11        Lisbon        Portugal
2  38.711050 -9.139739  05/14/2014 16:40        Lisbon        Portugal
3  38.715637 -9.120558  05/14/2014 18:25        Lisbon        Portugal
4  38.711977 -9.141788  05/14/2014 19:26        Lisbon        Portugal

In [83]:
munich_serbia = simplified[(simplified['city'] == 'Munich') |
                     (simplified['country'] == 'Serbia')]

In [84]:
len(munich_serbia)

4

### Q12: how many observations are west of the prime meridian?

In [93]:
west_prime_meridian = (simplified["lon"] < 0).count()

In [94]:
west_prime_meridian

178

In [96]:
west_prime_meridian_values = simplified[simplified["lon"]<0]

In [97]:
len(west_prime_meridian_values)

24

In [98]:
west_prime_meridian_values

,lat,lon,date,city,country
0,51.481292,-0.451011,05/14/2014 09:07,West Drayton,United Kingdom
1,38.781775,-9.137544,05/14/2014 15:11,Lisbon,Portugal
2,38.711050,-9.139739,05/14/2014 16:40,Lisbon,Portugal
3,38.715637,-9.120558,05/14/2014 18:25,Lisbon,Portugal
4,38.711977,-9.141788,05/14/2014 19:26,Lisbon,Portugal
5,38.723108,-9.113374,05/15/2014 11:34,Lisbon,Portugal
6,38.691944,-9.215561,05/15/2014 14:50,Lisbon,Portugal
7,38.708487,-9.136022,05/15/2014 16:49,Lisbon,Portugal
8,38.797558,-9.341000,05/16/2014 10:58,Algueirão-Mem Martins,Portugal
9,38.801171,-9.425103,05/16/2014 13:43,Sintra,Portugal
10,38.793071,-9.285825,05/16/2014 15:13,Sintra,Portugal
11,38.816611,-9.408500,05/16/2014 16:13,Sintra,Portugal
12,38.788205,-9.388018,05/16/2014 16:28,Sintra,Portugal
13,38.711024,-9.137398,05/16/2014 23:24,Lisbon,Portugal
14,38.742018,-9.169380,05/17/2014 09:24,Lisbon,Portugal
15,39.118383,-8.913738,05/17/2014 11:12,Azambuja,Portugal
16,39.272876,-8.712187,05/17/2014 11:27,Santarém,Portugal
17,39.476522,-8.634345,05/17/2014 11:42,Zibreira,Portugal
18,39.628772,-8.695136,05/17/2014 12:12,São Mamede,Portugal
19,39.841086,-8.718608,05/17/2014 12:28,Leiria District,Portugal
20,40.210869,-8.481383,05/17/2014 12:58,Coimbra Municipality,Portugal
21,40.609111,-8.544819,05/17/2014 13:28,Aveiro District,Portugal
22,41.062147,-8.575820,05/17/2014 13:58,Vila Nova de Gaia,Portugal
23,41.237205,-8.672173,05/18/2014 19:55,Maia,Portugal

### Q13: get all rows that contain a city that starts with the letter G